app/Models/ProfileModel.php

    public function getAllProfiles()
    {
        return $this->findAll();
---
SELECT *
FROM `profile`

    public function getDashboardPermissionsByProfile($profileId)
    {
        $builder = $this->db->table('profiledashboard');
        $builder->select('profiledashboard_id, add_dashboard, view_dashboard, edit_dashboard, delete_dashboard');
        $builder->where('profile_id', $profileId);

        $permissions = $builder->get()->getResultArray();
---
SELECT `profiledashboard_id`, `add_dashboard`, `view_dashboard`, `edit_dashboard`, `delete_dashboard`
FROM `profiledashboard`
WHERE `profile_id` = '1'